let exp = {
    s_vugyk: {
        name: "Вигук",
        rule: "Вигук — незмінювана особлива частина мови, яка виражає почуття, волевиявлення мовця, не називаючи їх.",
        words: `
*Эмоції* - овва, ой, ох, ах, ей, ех, ух, тю, фу, тьху, ой лишенько, от тобі й на, слава Богу, де ж пак, ґвалт, вак, опа, ох йо

*Спонукальні* - геть, годі, циті, ти, анумо, гайда, гей, вигук, агов, алло, киш, ну, но, гилля, тпру

*Формули спілкування (клiше)* - до побачення, будь ласка, спасибі, дякую, добридень, на добраніч, вибачте, їй-богу, прощайте, прошу

*Звуко наслідувані* - гав-гав, мур-мур, тук-тук, пі-пі-пі, вжух, му-у-у, бе-е-е, беме, ква-ква, кхе-кхе, бах, дзень
        `,
        test: [
            "овва", "ой", "ох", "ах", "ей", "ех", "ух", "тю", "фу", "тьху", "ой лишенько", "от тобі й на",
            "слава Богу", "де ж пак", "ґвалт", "вак", "опа", "ох йо",
            "геть", "годі", "циті", "ти", "анумо", "гайда", "гей", "вигук", "агов", "алло", "киш",
            "ну", "но", "гилля", "тпру",
            "до побачення", "будь ласка", "спасибі", "дякую", "добридень", "на добраніч", "вибачте",
            "їй-богу", "прощайте", "прошу",
            "гав-гав", "мур-мур", "тук-тук", "пі-пі-пі", "вжух", "му-у-у", "бе-е-е", "беме", "ква-ква",
            "кхе-кхе", "бах", "дзень"
        ]
    },
    s_priymennik: {
        name: "Прийменник",
        rule: `
*Прийменник* - це службова частина мови, що виступає разом з відмінковою формою іменника, займенника або числівника для вираження залежності її від інших слів у словосполученні
Ділиться на *похідний* і *непохідний* та прості, складні, складені

*Складні* - утворені від кількох прийменників (наприклад: понад, попід)
*Складені* - утворені від кількох слів (наприклад: поруч з, згідно з)
        `,
        words: `
            Без, в, у, від, до, з, за, між, проти, з-під, з-перед, поміж, на, над, через, понад, крізь, про, під, по, незважаючи на, попід, перед, у зв'язку з, згідно з, слідом за, о, при
        `,

        test: [
            "Без", "в", "у", "від", "до", "з", "за", "між", "проти", "з-під", "з-перед", "поміж", "на", "над",
            "через", "понад", "крізь", "про",
            "під", "по", "незважаючи на", "попід", "перед", "у зв'язку з", "згідно з", "слідом за", "о", "при"
        ]
    },
    s_spolychnik: {
        name: "Сполучник",
        rule: `
*Сполучник* - службова частина мови, що поєднує (сполучає) однорідні члени речення і частини складного речення

Вони діляться на сполучники *сурядності* та *підрядності*.

*Сполучниики сурядності* поєднують однорідні члени речення або рівноправні частини складного речення
*Сполучники підрядності* поєднують головну й залежну частини складного речення

За будовою бувають: *прості*, *складні*, *складені*
        `,
        words: `
*Сполучниики сурядності*:
    *Єднальні*: і, й, та (у значенні і), і... і, ні... ні, ані... ані;
    *Протиставні*: а, але, та (у значенні але), проте, зате, однак;
    *Розділові*: аби, чи, хоч, або.. або, чи.. чи, не то.. не то, чи то.. чи то;
*Сполучники підрядності*:
    *часові*: коли, доки, як тільки, перед тим як, після того як, з того часу як, звідтоді;
    *причинові*: бо, тому що, через те що, завдяки тому що, оскільки, у зв'язку з тим що, з огляду на те що;
    *мети*: щоб, для того, аби, з тим щоб;
    *умовні*: як, якщо, якби, коли, коли б;
    *допустові*: хоч, дарма що, хай, незважаючи на те, що;
    *наслідкові*: так що, так що й, отож;
    *порівняльні*: як, мов, мовби, ніж, наче, неначе, начебто, нібито;
    *з'ясувальні*: що, щоб, як
        `,

        test: [
            "і", "й", "та", "і... і", "ні... ні", "ані... ані",
            "а", "але", "та", "проте", "зате", "однак",
            "аби", "чи", "хоч", "або.. або", "чи.. чи", "не то.. не то", "чи то.. чи то",
            "коли", "доки", "як тільки", "перед тим як", "після того як", "з того часу як", "звідтоді",
            "о", "тому що", "через те що", "завдяки тому що", "оскільки", "у зв'язку з тим що",
            "з огляду на те що",
            "щоб", "для того", "аби", "з тим щоб",
            "як", "якщо", "якби", "коли", "коли б",
            "хоч", "дарма що", "хай", "незважаючи на те, що",
            "так що", "так що й", "отож",
            "як", "мов", "мовби", "ніж", "наче", "неначе", "начебто", "нібито",
            "що", "щоб", "як"
        ]
    },
    s_chastka: {
        name: "Частка",
        rule: `
*Частка* - це службова частина мови, яка:
    • надає слову або реченню додаткових відтінків значення;
    • служить засобом творення граматичних форм слів та похідних слів.
        `,
        words: `
*Формотворчі*:
    би, б, хай, нехай
*Словотворчі*:
    аби, де, будь-, -будь, -небудь, казна-, хтозна-, чи-, що-, -сь, -ж, -же, не, ні
*Модальні*:
    *Питальні*:
        чи, хіба, невже, що за
    *Підсилювальні*:
        аж, же, ж, би, б, то, таки
    *Ствержувальні*:
        еге, отож, так, авжеж
    *Вказівні*:
        ще, оце, то, ось, он, ото
    *Порівняльні*:
        мов, немов, наче, неначе, майже, мало, ледве
    *Видільні*:
        тільки, лише, же, ж, хоча, таки
    *Означальні*:
        ледве, якраз, саме, майже, просто
    *Спонукальні*:
        бодай, ну-бо, годі
    *Заперечні*:
        не, ні, ані
        `,

        test: [
            "би", "б", "хай", "нехай",
            "аби", "де", "будь-", "-будь", "-небудь", "казна-", "хтозна-", "чи-", "що-", "-сь", "-ж", "-же",
            "не", "ні",
            "чи", "хіба", "невже", "що за",
            "аж", "же", "ж", "би", "б", "то", "таки",
            "еге", "отож", "так", "авжеж",
            "ще", "оце", "то", "ось", "он", "ото",
            "мов", "немов", "наче", "неначе", "майже", "мало", "ледве",
            "тільки", "лише", "же", "ж", "хоча", "таки",
            "ледве", "якраз", "саме", "майже", "просто",
            "бодай", "ну-бо", "годі",
            "не", "ні", "ані"
        ]
    },
}

module.exports = exp